andyzaur/wifi-csi-indoor-localization/csi_rx/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c6"

# Flash (WROOM-1U N8 has 8MB flash)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Console over native USB
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Enable CSI
CONFIG_ESP_WIFI_CSI_ENABLED=y
